tutorials/rectangle_compress_mdot/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}

application     foamRun;

solver          fluid;

startFrom       startTime;

startTime       0.0;

stopAt          endTime;

endTime         5e-3;

deltaT          5e-5;

writeControl    adjustableRunTime;

writeInterval   5e-4;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.8;

libs
(
"libsyntheticTurbulenceInlet.so"
);

functions
{
    #includeFunc    patchSurface
}


// ************************************************************************* //
