tutorials/rectangle_compress_mdot/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//
numberOfSubdomains  12;

method          hierarchical;

/*
coeffs
{
	n (3 2 2);
}
*/

//coeffs
hierarchicalCoeffs
{
  n (3 2 2);
  order xyz;
}



// ************************************************************************* //
